---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyle.BorderBottomLineStyle
source: html/43c56db0-3f2b-8b8b-397f-8e271cc44008.htm
---
# Autodesk.Revit.DB.TableCellStyle.BorderBottomLineStyle Property

The element id (GraphicsStyle element) for the bottom line of the cell border.

## Syntax (C#)
```csharp
public ElementId BorderBottomLineStyle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null